Tekla Open API Reference for Tekla Structures 2025
ContourPlate.Type Property
 Gets the read only type of the contour plate. In creation, the type is defined based on the material. If the material is concrete, the type will be slab, otherwise plate.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ContourPlate.ContourPlateTypeEnum Type { get; }
Public ReadOnly Property Type As ContourPlate.ContourPlateTypeEnum
	Get
Property Value
Type: ContourPlate.ContourPlateTypeEnum
See Also
Reference
ContourPlate Class
Tekla.Structures.Model Namespace